function populate() {
    if(quiz.isEnded()) {
        showScores();
    }
    else {
        // show question
        var element = document.getElementById("question");
        element.innerHTML = quiz.getQuestionIndex().text;

        // show options
        var choices = quiz.getQuestionIndex().choices;
        for(var i = 0; i < choices.length; i++) {
            var element = document.getElementById("choice" + i);
            element.innerHTML = choices[i];
            guess("btn" + i, choices[i]);
        }

        showProgress();
    }
};

function guess(id, guess) {
    var button = document.getElementById(id);
    button.onclick = function() {
        quiz.guess(guess);
        populate();
    }
};


function showProgress() {
    var currentQuestionNumber = quiz.questionIndex + 1;
    var element = document.getElementById("progress");
    element.innerHTML = "Питання " + currentQuestionNumber + " з " + quiz.questions.length;
};

function showScores() {
    var gameOverHTML = "<h1>Результат</h1>";
    gameOverHTML += "<h2 id='score'> Ваш рахунок: " + quiz.score + "</h2>";
    var element = document.getElementById("quiz");
    element.innerHTML = gameOverHTML;
};

// create questions
var questions = [
    new Question("Хто з вчених запропонував термін 'клітина'?", ["М.Шлейден", "Р.Гук","Т.Шванн", "І.Мечников"], "Р.Гук"),
    new Question("Різновидом якої тканини є хрящова тканина?", ["м’язової", "нервової","сполучної", "епітеліальної"], "сполучної"),
    new Question("Бактерії круглої форми називаються", ["Коками", "Спірилами","Бацилами", "Вібріонами"], "Коками"),
    new Question("До надмембранних структур належить", ["Компартменти", "Плазмодесми","Глікокалікс", "Цитоскелет"], "Глікокалікс"),
    new Question("Відокремлення цитоплазми від клітинної стінки називається", ["Ендоцитоз", "Піноцитоз","Екзоцитоз", "Плазмоліз"], "Плазмоліз"),
    new Question("Укажіть надмембранну структуру рослинної клітини", ["Цитоплазматична мембрана", "Клітинна стінка","Глікокалікс", "Плазмалема"], "Клітинна стінка"),
    new Question("Внутрішнє середовище клітини", ["Каріоплазма", "Матрикс","Цитоплазма", "Ферменти"], "Цитоплазма"),
    new Question("До непостійних структур клітини відносять", ["Мітохондрії", "Ядро","Рибосоми", "Включення"], "Включення"),
    new Question("Укажіть групу органел,що належать до одномембранних", ["Рибосоми, пластиди, вакуолі", "Комплекс Гольджі, мітохондрії,рибосоми","Вакуолі, комплекс Гольджі, лізосоми", "Ядро, мітохондрії, пластидия"], "Вакуолі, комплекс Гольджі, лізосоми"),
    new Question("Укажіть групу органел,що належать до двомембранних", ["Ядро, мітохондрії, пластиди", "Комплекс Гольджі, мітохондрії, рибосоми","Вакуолі, комплекс Гольджі, лізосоми", "Лізосоми, пластиди, мітохондрії"], "Ядро, мітохондрії, пластиди"),
    new Question("Серед перелічених виберіть немембранні органели", ["Рибосоми, клітинний центр", "Вакуолі, рибосоми","Лізосоми, пластиди", "Мітохондрії, ядро"], "Рибосоми, клітинний центр"),
    new Question("Як називаються хромосоми,що несуть однакові гени і є однаковими ззовні?", ["Аутосоми", "Гомологічні","Соматичні", "Статеві"], "Аутосоми"),
    new Question("Скільки аутосом  і яку статеву хромосому одержує донька від батька?", ["22 аутосоми та У- хромосому", "23 аутосоми та У– хромосому","22 аутосоми та Х-хромосому", "23 аутосоми та Х– хромосому"], "22 аутосоми та Х-хромосому"),
    new Question("Які статеві хромосоми присутні в каріотипі жінки?", ["ХУ", "ХХ","Тільки Х", "Тільки У"], "ХХ"),
    new Question("Синдром Дауна – це аномалія, зумовлена:", ["Зникненням однієї хромосоми", "Зникненням пари хромосом","Появою зайвої хромосоми", "Появою зайвої пари хромосом"], "Появою зайвої хромосоми"),
    new Question("Назва процесу злиття жіночої та чоловічої статевих клітин:", ["оогенез", "гаметогенез","запліднення", "сперматогенез"], "запліднення"),
    new Question("Під час гаметогенезу на стадії дозрівання клітини діляться шляхом:", ["мітозу", "мейозу","мітозу та мейозу", "не діляться"], "мейозу"),
    new Question("Партеногенез — це:", ["процес утворення органів", "процес утворення тканин","індивідуальний розвиток організму", "розвиток з незаплідненої яйцеклітини"], "розвиток з незаплідненої яйцеклітини"),
    new Question("Гермафродити – це особини:", ["різних статей одного виду", "однієї статі одного виду","однієї статі різних видів", "двостатеві, які продукують і чоловічі і жіночі статеві гамети"], "різних статей одного виду"),
    new Question("Вкажіть, ознаки якої мінливості передаються наступному поколінню:", ["модифікаційної", "мутаційної","цитоплазматичної", "ядерна"], "ядерна"),
    new Question("Вкажіть, як називають межі модифікаційної мінливості:", ["варіаційним рядом", "варіаційною кривою","модифікаціями", "нормою реакції"], "нормою реакції"),
    new Question("До складу ядра входять:", ["каріоплазма, ядерце, хроматин", "пластиди, мітохондрії","кристи, тилакоїд", "органоїди, клітинний сік"], "каріоплазма, ядерце, хроматин"),
    new Question("Короткі відростки нейрона називаються:", ["аксонами", "дендритами","нейрофібрилами", "нейрини"], "дендритами"),
    new Question("Нерви – це:", ["скупчення відростків нервових клітин, вкритих загальною оболонкою", "скупчення тіл нейронів","скупчення нейронів і клітин супутників", "нервова тканина"], "скупчення відростків нервових клітин, вкритих загальною оболонкою"),
    new Question("Органели, що виконують функцію травної системи клітини, – це:", ["рибосоми", "мітохондрії","лізосоми", "Апарат Гольджі"], "лізосоми"),
    new Question("Укажіть назву клітинної органели,яка бере участь в утворенні веретена поділу під час мітозу:", ["ядро", "ендоплазматична сітка","рибосоми", "клітинний центр"], "ядро"),
    new Question("Укажіть у якій фазі мітозу парні хроматини відділяються одна від одної і переміщуються до протилежних полюсів:", ["в анафазі", "у профазі","у метафазі", "у телофазі"], "в анафазі"),
    new Question("Укажіть,у якій фазі поділу клітини зникає ядерце:", ["у профазі", "у телофазі","у метафазі", "в інтерфазі"], "у профазі"),
    new Question("Позначте форму статевого розмноження одноклітинних:", ["поліембріонія", "копуляція","сперматогенез", "мейоз"], "сперматогенез"),
    new Question("Укажіть чим відрізняється зигота від яйцеклітини:", ["кількістю оболонок", "набором хромосом","кількістю органоїдів", "кількістю жовтка"], "набором хромосом"),
    new Question("Модифікаційна мінливість організму зумовлена:", ["впливом чинників середовища", "дією мікрофлори організму","кросинговером у процесі мейозу", "спадковими чинниками"], "впливом чинників середовища"),
    new Question("Межі модифікаційної мінливості визначає:", ["вплив середовища", "генотип і внутрішнє середовище","генотип організму", "частота мутацій"], "генотип і внутрішнє середовище"),
    new Question("Укажіть властивості модифікацій:", ["мають масовий пристосувальний характер,не спадкуються", "спадкуються","виникають раптово", "є матеріалом для природнього добору"], "мають масовий пристосувальний характер,не спадкуються"),
    new Question("Норма реакції-це:", ["вид внутріалельної взаємодії генів", "вид міжалельної взаємодії генів","межі модифікаційної мінливості", "спадкування якісних ознак"], "межі модифікаційної мінливості"),
    //new Question("Which language is used for styling web pages?", ["HTML", "JQuery", "CSS", "XML"], "CSS"),
    //new Question("There are ____ main components of object oriented programming.", ["1", "6","2", "4"], "4"),
    //new Question("Which language is used for web apps?", ["PHP", "Python", "Javascript", "All"], "All"),
    //new Question("MVC is a ____.", ["Language", "Library", "Framework", "All"], "Framework")
];

// create quiz
var quiz = new Quiz(questions);

// display quiz
populate();





